CMD_HELP_MESSAGE = "Help message."

BOT_WORKS_IN_PRIVATE_CHAT_ONLY = "Бот работает только в приватных чатах."
ENTER_YOUR_TIMEZONE_AFTER_START = "Отлично, сейчас введи свой часовой пояс (Например UTC+2 или GMT-2), чтоб всё было вовремя. После этого ознакомься с функционалом, нам есть чем тебя удивить."
AFTER_ADDING_TIMEZONE = "Ты находишься в %s часовом поясе, твоё текущее время: \"%s\". Пройдёмся по функционалу. У нас ты можешь: подписаться на рассылку рекомендаций о здоровье в течении дня, создать напоминание о своём событии, воспользоваться калькулятором сна."
INVALID_TIMEZONE = "Часовой пояс введен некорректно, попробуй снова."

AFTER_UPDATING_TIMEZONE = "Ты находишься в %s часовом поясе, твоё текущее время: \"%s\"."

ENTER_YOUR_TIMEZONE = "Введи свой часовой пояс (Например UTC+2 или GMT-2)"

YOUR_TIME_NOW = "Так, так, так! Сейчас у тебя %s."


YOU_ARE_IN_TZ = "У меня записано, что ты находишься в часовом поясе %s и твое время сейчас %s. Для изменения нажми на кнопку \"Изменить часовой пояс\"" 

MAILING_INFO = """Наша рассылка представляет из себя ряд полезных советов для здоровья, среди них напоминания:

-выпей воды 
-выпрями спину
-втяни живот 
-время отбоя
-полезные статьи о здоровье 

Нажми "подписаться на рассылку" если согласен. """

AFTER_SUBSCRIBING_MAILING = "В ближайшее время я о себе напомню."
AFTER_UNSUBSCRIBING_MAILING = "Ты успешно отписался от рассылки."
MENU = "Меню:"

THIS_OPTION_IS_UNRELEASED_YET = "Извиняюсь, эта функция еще не релизована, но будет уже в скором времени!"

ENTER_EVENT_TIME = "Введи время события: (HH:MM)"
ENTER_EVENT_TITLE = "О чём тебе напомнить?"
ENTER_EVENT_REMIND_TIMES = "В течение скольких дней напоминать?"

INVALID_TITLE = "Максимальная длина названия не должна превышать 265 символов."
INVALID_TIME = "Некорректно введено время, попробуй еще раз."
INVALID_TIMES = "Некорректно введено количество повторений, введи еще раз."
EVENT_SUCCESSFULY_ADDED = "Понял, принял. В \"%s\" я напомню о \"%s\"."

PAGINATE_EVENTS = "Ваши события: (страница %s из %s )\n"
YOU_DONT_HAVE_EVENTS = "У вас нет запланированых событий."


IF_TIME_LESS_19_00 = """Ещё совсем рано, а ты уже хочешь спать? Reminder не советует спать в это время.
Ты действительно сильно устал(а)?"""

IF_WANT_TO_SLEEP = "Окей. Тогда можешь прилечь на 15-30 минут. Но не больше! Кратковременный сон позволит твоему мозгу перезагрузиться."
IF_DONT_WANT_TO_SLEEP = """Умойся холодной водой. Прогуляйся на свежем воздухе. Отожмись пару раз

P.S Только не усни во время отжиманий"""


IF_TIME_BETWEEN_19_20 = """Тебе лучше лечь в ближайшие пару часов! Но не сейчас!
Что бы не пропустить оптимальный отход ко сну из-за залипания в смартфоне - поставь напоминание от Reminder.
Я люблю напоминать о важном."""


IF_TIME_AFTER_20 = """Минутка математики:

У тебя сейчас %s + среднее время для здорового сна = (%s + 8 часов)

Тебе стоит проснуться в %s

Не забудь поставить будильник!"""


READ_EVENT_TEMPLATE = "<b>%s</b>\nВремя напоминания: %s\nОставшееся кол-во напоминаний: %s"

EDIT_EVENT_TEXT = "Нажми кнопку: \n📝 для изменения названия \n🕐 для изменения времени \n🔂 для изменения кол-ва повторений"

ENTER_EDIT_EVENT_TITLE = f"{ENTER_EVENT_TITLE} \nТекущий текст события: \n<code>%s</code>"
