BOT_WORKS_IN_PRIVATE_CHAT_ONLY = "Бот работает только в приватных чатах."
ENTER_YOUR_TIMEZONE_AFTER_START = "Отлично, сейчас введи свой часовой пояс (Например UTC+2 или GMT-2), чтоб всё было вовремя. После этого ознакомься с функционалом, нам есть чем тебя удивить."
AFTER_ADDING_TIMEZONE = "Ты находишься в %s часовом поясе, твоё текущее время: \"%s\". Пройдёмся по функционалу. У нас ты можешь: подписаться на рассылку рекомендаций о здоровье в течении дня, создать напоминание о своём событии, воспользоваться калькулятором сна."
INVALID_TIMEZONE = "Часовой пояс введен некорректно, попробуй снова."

AFTER_UPDATING_TIMEZONE = "Ты находишься в %s часовом поясе, твоё текущее время: \"%s\"."

ENTER_YOUR_TIMEZONE = "Введи свой часовой пояс (Например UTC+2 или GMT-2)"

YOUR_TIME_NOW = "Так, так, так! Сейчас у тебя %s."


YOU_ARE_IN_TZ = "У меня записано, что ты находишься в часовом поясе %s и твое время сейчас \"%s\". Для изменения нажми на кнопку \"Изменить часовой пояс\"" 

MAILING_INFO = """Наша рассылка представляет из себя ряд полезных советов для здоровья, среди них напоминания:

-выпей воды 
-выпрями спину
-втяни живот 
-время отбоя
-полезные статьи о здоровье 

Нажми "подписаться на рассылку" если согласен. """

AFTER_SUBSCRIBING_MAILING = "В ближайшее время я о себе напомню."
AFTER_UNSUBSCRIBING_MAILING = "Ты успешно отписался от рассылки."
MENU = "Меню:"

THIS_OPTION_IS_UNRELEASED_YET = "Извиняюсь, эта функция еще не релизована, но будет уже в скором времени!"

ENETER_EVENT_TIME = "Введи время события: (HH:MM)"
ENTER_EVENT_TITLE = "О чём тебе напомнить?"
ENTER_EVENT_REMIND_TIMES = "Сколько раз напомнить?"

INVALID_TIME = "Некорректно введено время, попробуй еще раз."
INVALID_TIMES = "Некорректно введено количество повторений, введи еще раз."
EVENT_SUCCESSFULY_ADDED = "Понял, принял. В \"%s\" я напомню о \"%s\"."

PAGINATE_EVENTS = "Ваши события: (страница %s из %s )\n"
YOU_DONT_HAVE_EVENTS = "У вас нет запланированых событий."