BOT_WORKS_IN_PRIVATE_CHAT_ONLY = "Бот работает только в приватных чатах."
ENTER_YOUR_TIMEZONE = "Отлично, сейчас введи свой часовой пояс (Например UTC+2 или GMT-2), чтоб всё было вовремя. После этого ознакомься с функционалом, нам есть чем тебя удивить."
AFTER_UPDATING_TIMEZONE = "Ты находишься в %s часовом поясе, твоё текущее время: \"%s\". Пройдёмся по функционалу. У нас ты можешь: подписаться на рассылку рекомендаций о здоровье в течении дня, создать напоминание о своём событии, воспользоваться калькулятором сна."
INVALID_TIMEZONE = "Часовой пояс введен неверно, попробуй снова."


MAILING_INFO = """Наша рассылка представляет из себя ряд полезных советов для здоровья, среди них напоминания:

-выпей воды 
-выпрями спину
-втяни живот 
-время отбоя
-полезные статьи о здоровье 

Нажми "подписаться на рассылку" если согласен. """

AFTER_SUBSCRIBING_MAILING = "В ближайшее время я о себе напомню."
AFTER_UNSUBSCRIBING_MAILING = "Ты успешно отписался от рассылки."
MENU = "Меню:"

THIS_OPTION_IS_UNRELEASED_YET = "Извиняюсь, эта функция еще не релизована, но будет уже в скором времени!"